#+title: Notas de Aula - 08 Boas Práticas
#+author: Luigi D. C. Soares
#+startup: entitiespretty
#+options: toc:nil  num:nil

Características de um bom código:
- *Compreensível* por quem escreveu e por quem irá utilizar
- *Confiável*: funciona conforme o esperado
- *Eficiente*:
  - Utiliza os recursos disponíveis da melhor maneira possível
  - Escolha das estruturas mais adequadas
- *Extensível / Fácil manutenção*: fácil de ser modificado/corrigido no futuro

O que dificulta a escrita de códigos limpos?
- Prazos apertados = foco nas funcionalidades
- Projetos longos: acúmulo de problemas (deixados para depois)

Dicas:
- Seja consistente com as convenções adotadas (nomes, formatação, organização, ...)
- Modele antes de implementar (CRC, UML) --> iremos ver mais à frente

- Definir tipos específicos para o problema (código mais legível)
- Tratar situações excepcionais (tratamento de exceções, final do semestre)
  - Robustez
  - Tolerância a falhas

* Extensível / Fácil manutenção

Cada módulo/classe/método/função possui _uma única_ responsabilidade (single responsibility principle, SRP)
- "The Single Responsibility Principle (SRP) states that a class or module should have one, and only one, reason to change" (Clean code, "Uncle Bob")
- Note que uma classe com única responsabilidade não necessariamente significa uma classe com uma única função!

Exemplo: imagine um pedido em uma compra (retirado daqui: https://www.youtube.com/watch?v=pTB30aXS77U)

Versão inicial:

=item.hpp=

#+begin_src C++ :exports code :tangle include/item.hpp :main no
#pragma once

#include <string>

class Item {
public:
  unsigned code;
  std::string name;
  float price;

  bool operator==(Item const &other) const {
    return code == other.code;
  }
};
#+end_src

=order.hpp=

#+begin_src C++ :exports code :tangle include/order.hpp :main no
#pragma once

#include <unordered_map>
#include "item.hpp"

class Order {
public:
  enum class Status { open, paid };
  Status status = Status::open;

  void add_item(Item item);
  float total_price() const;
  void pay(std::string payment_type);

private:
  class _HashItem {
  public:
    std::size_t operator()(Item const &item) const {
      std::hash<unsigned> hasher;
      return hasher(item.code);
    }
  };

  std::unordered_map<Item, unsigned, _HashItem> _items_quantities;
};
#+end_src

=order.cpp=

#+begin_src C++ :exports code :tangle src/order.cpp :main no
#include "order.hpp"
#include <iostream>

void Order::add_item(Item item) {
  _items_quantities.insert({item, 0});
  _items_quantities[item]++;
}

float Order::total_price() const {
  float total = 0.0;
  for (auto [item, quantity] : _items_quantities) {
    total += item.price * quantity;
  }
  return total;
}

void Order::pay(std::string payment_type) {
  if (payment_type == "debit") {
    std::cout << "Processing debit payment type" << std::endl;
    // Outras coisas...
    status = Status::paid;
  } else if (payment_type == "credit") {
    std::cout << "Processing credit payment type" << std::endl;
    // Outras coisas...
    status = Status::paid;
  }
}
#+end_src

#+begin_src C++ :exports both :flags -std=c++17 src/order.cpp -I include/ :results scalar
#include <iostream>
#include "order.hpp"

int main() {
  Order order;

  order.add_item({0, "Notebook", 5000.50});
  order.add_item({1, "TV 4K", 8764.50});

  std::cout << order.total_price() << std::endl;
  order.pay("credit");

  return 0;
}
#+end_src
  
#+RESULTS:
: 13765
: Processing credit payment type

A pergunta é: o pedido (Order) deveria ser responsável pelo processamento do pagamento?
- O que constitui um pedido? A coleção de itens!
- Imagine que vamos precisar alterar a classe Order: que motivo poderia nos levar a fazer uma alteração? Alteração na forma de inserção ou no cálculo do preço total. Forma de pagamento *não deveria ser um motivo para alterar a classe Order*

Versão que obedece ao SRP:

=order_v2.hpp=

#+begin_src C++ :exports code :tangle include/order_v2.hpp :main no
#pragma once

#include <unordered_map>
#include "item.hpp"

class Order {
public:
  enum class Status { open, paid };
  Status status = Status::open;

  void add_item(Item item);
  float total_price() const;

private:
  class _HashItem {
  public:
    std::size_t operator()(Item const &item) const {
      std::hash<unsigned> hasher;
      return hasher(item.code);
    }
  };

  std::unordered_map<Item, unsigned, _HashItem> _items_quantities;
};
#+end_src

=order_v2.cpp=

#+begin_src C++ :exports code :tangle src/order_v2.cpp :main no
#include "order_v2.hpp"
#include <iostream>

void Order::add_item(Item item) {
  _items_quantities.insert({item, 0});
  _items_quantities[item]++;
}

float Order::total_price() const {
  float total = 0.0;
  for (auto [item, quantity] : _items_quantities) {
    total += item.price * quantity;
  }
  return total;
}
#+end_src

=payment_processor.hpp=

#+begin_src C++ :exports code :tangle include/payment_processor.hpp :main no
#pragma once

#include <string>
#include "order_v2.hpp"

class PaymentProcessor {
public:
  void pay(std::string payment_type, Order &order);
};
#+end_src

=payment_processor.cpp=

#+begin_src C++ :exports code :tangle src/payment_processor.cpp :main no
#include "payment_processor.hpp"

#include <iostream>
#include <string>

void PaymentProcessor::pay(std::string payment_type, Order &order) {
  if (payment_type == "debit") {
    std::cout << "Processing debit payment type" << std::endl;
    // Outras coisas...
    order.status = Order::Status::paid;
  } else if (payment_type == "credit") {
    std::cout << "Processing credit payment type" << std::endl;
    // Outras coisas...
    order.status = Order::Status::paid;
  }
}
#+end_src

#+begin_src C++ :exports both :flags -std=c++17 -I include/ src/order_v2.cpp src/payment_processor.cpp :results scalar
#include <iostream>
#include <map>
#include <vector>

#include "order_v2.hpp"
#include "payment_processor.hpp"

int main() {
  Order order;

  order.add_item({0, "Notebook", 5000.50});
  order.add_item({1, "TV 4K", 8764.50});

  std::cout << order.total_price() << std::endl;

  PaymentProcessor processor;
  processor.pay("credit", order);

  return 0;
}
#+end_src

#+RESULTS:
: 13765
: Processing credit payment type
  
- SRP faz parte de um conjunto de cinco princípios: SOLID (vale pesquisar; o vídeo acima exemplifica os cinco)
- Veremos alguns deles mais tarde

